Revit 2026 API

# IControllableDropHandler Interface

---

An interface to be executed when custom data is dragged and dropped onto the Revit user interface. This interface is different from IDropHandler in that it allows the handler to verify whether the drop event can be executed on the given view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IControllableDropHandler : IDropHandler
```
```vb
Public Interface IControllableDropHandler
	Inherits IDropHandler
```
```cpp
public interface class IControllableDropHandler : IDropHandler
```
```fsharp
type IControllableDropHandler =
    interface
        interface IDropHandler
    end
```

The IControllableDropHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanExecute | Implement this method to inform Revit whether the drop event can be executed onto the given view. |
|  | Execute | Implement this method to handle the drop event for your data. (Inherited from IDropHandler) |

Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.

#### Reference

Autodesk.Revit.UI Namespace